In [8]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [12]:
data = [['Adrian', 20], ['Bethany', 23], ['Chloe', 41]]
df = pd.DataFrame(data, columns=['Name', 'Age'], dtype=int)
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

In [13]:
new_dict = {'name': [ 'Tom', 'Jane', 'Steve', 'Lucy'], 'Sales': [250, 300, 350,400]}
df_dict = pd.DataFrame (new_dict)
df_dict

    name  Sales
0    Tom    250
1   Jane    300
2  Steve    350
3   Lucy    400

In [16]:
df_dict_index = pd. DataFrame(new_dict, index=['ranki', 'rank2', 'rank3', 'rank4'])

In [17]:
df_dict_index

        name  Sales
ranki    Tom    250
rank2   Jane    300
rank3  Steve    350
rank4   Lucy    400

In [22]:
dict_list = [{'Name':'Tom', 'Sales': 250}, { 'Name':'Jan', 'Sales':300}, { 'Name':'Steve', 'Sales':350}]
df_dict_list = pd.DataFrame(dict_list)
df_dict_list

    Name  Sales
0    Tom    250
1    Jan    300
2  Steve    350

In [23]:
east = pd.Series([1000, 1200], index = ['q1', 'q2'])
west = pd.Series([1500, 1200, 4000], index = ['q1', 'q2', 'q3'])
west
east

q1    1000
q2    1200
dtype: int64

In [24]:
west

q1    1500
q2    1200
q3    4000
dtype: int64

In [25]:
df_region = pd.DataFrame({"East":east, "West":west})
df_region

      East  West
q1  1000.0  1500
q2  1200.0  1200
q3     NaN  4000

In [ ]:
df_region['North'] = [200, 3000, 1234]
df_region